//import java.util.Scanner;
//
//public class LoopsDemo {
//    public static void main(String[] args) {
//        //--------------------------------------------------------------------
//        // while (цикл с предусловие)
//        //--------------------------------------------------------------------
//        /*
//        while(<cond>)
//            <statement>
//
//        <cond> - выражение булевого типа
//        <statement> - оператор или блок операторов языка Java.
//                      Блок операторов - это последовательность операторов,
//                      заключенная в {}
//        При входе в цикл вычисляется условие, если результат истина, то
//        выполняется <statement>, иначе цикл заканчивается. После выполнения
//        <statement> снова вычисляется условие. И так далее.
//         */
////        Scanner sc = new Scanner(System.in);
////        int num = sc.nextInt();
////        while (num > 0) {
////            System.out.println(num);
////            --num;
////        }
//
//        //--------------------------------------------------------------------
//        // do while (цикл с постусловие)
//        //--------------------------------------------------------------------
//        /*
//        do
//            <statement>
//        while(<cond>);
//
//        <cond> - выражение булевого типа
//        <statement> - оператор или блок операторов языка Java.
//                      Блок операторов - это последовательность операторов,
//                      заключенная в {}
//        При входе в цикл выполняется <statement>, после чего вычисляется
//        <cond>. Если результат истина, то процесс повторяется, иначе
//        цикл завершает работу.
//         */
//
////        Scanner sc = new Scanner(System.in);
////        int num = sc.nextInt();
////        do {
////            System.out.println(num);
////            --num;
////        } while (num > 0);
//
//        //--------------------------------------------------------------------
//        // for (цикл подсчета)
//        //--------------------------------------------------------------------
//        /*
//        for(<init>; <cond>; <upd>)
//            <statement>
//
//        <init> - оператор, выполняющихся ОДИН РАЗ при входе в цикл
//        <cond> - выражение булевого типа
//        <statement> - оператор или блок операторов языка Java.
//                      Блок операторов - это последовательность операторов,
//                      заключенная в {}
//        <upd> - оператор, который выполняется ПОСЛЕ КАЖДОЙ итерации цикла
//         */
//
//        Scanner sc = new Scanner(System.in);
////        int num = sc.nextInt();
////        for(; num > 0;) {
////            System.out.println(num);
////            --num;
////        }
////        int num = sc.nextInt();
////        for(; num > 0; --num) {
////            System.out.println(num);
////        }
//        int num = sc.nextInt();
//        for(int i = num; i > 0; --i) {
//            System.out.println(i);
//        }
//    }
//}
